### Import modules

In [1]:
import pandas as pd 
import numpy as np 

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan data frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  7  4  6  6  1
1  6  7  8  7  6
2  3  9  3  5  5
3  8  7  1  5  5
4  9  4  1  2  1

### Membalik urutan kolom

In [3]:
df.loc[:,::-1]

   E  D  C  B  A
0  1  6  6  4  7
1  6  7  8  7  6
2  5  5  3  9  3
3  5  5  1  7  8
4  1  2  1  4  9

### Membalik urutan baris

In [5]:
df.loc[::-1]

   A  B  C  D  E
4  9  4  1  2  1
3  8  7  1  5  5
2  3  9  3  5  5
1  6  7  8  7  6
0  7  4  6  6  1

### Membalik urutan baris
###### tanda titik dua di akhir sebenarnya tidak penting, jadi bisa saja dihilangkan

In [6]:
df.loc[::-1,:]

   A  B  C  D  E
4  9  4  1  2  1
3  8  7  1  5  5
2  3  9  3  5  5
1  6  7  8  7  6
0  7  4  6  6  1

### Membalik urutan baris dan melakukan penyesuaian ulang index

In [7]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  4  1  2  1
1  8  7  1  5  5
2  3  9  3  5  5
3  6  7  8  7  6
4  7  4  6  6  1